app/Http/Controllers/RSSArticlesController.php

select * from `rss_feed` where `rss_feed`.`deleted_at` is null order by `published_at` desc limit 15 offset 0
select count(*) as aggregate from `rss_feed` where `rss_feed`.`deleted_at` is null
---
    public function index()
    {
        $rssFeeds = RSSFeed::query()->orderBy('published_at', 'desc')->paginate();